the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
void UserInterface_p_DrawActions(const char* actions)
{
	if (actions == NULL || strlen(actions) < 4)
		return;
	
	if (actions[g_menuActionsOffset+0] != ' ')
	{
		ssd1306_SetCursor(5, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+0], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+1] != ' ')
	{
		ssd1306_SetCursor(40, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+1], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+2] != ' ')
	{
		ssd1306_SetCursor(75, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+2], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+3] != ' ')
	{
		ssd1306_SetCursor(110, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+3], Icon_11x18, White);
	}
}



// Page Callbacks

void UserInterface_InitPages(UiHandle* uih)
{
	uih->pages = malloc(sizeof(UiPage) * MaxPages);
	if (!uih->pages)
		return;
	
	/* Init Main Page */
	uih->pages[MainPageIdx].text = "Main Page";
	uih->pages[MainPageIdx].actionIcons = "&  )";
	uih->pages[MainPageIdx].onInit = NULL;
	uih->pages[MainPageIdx].onUpdate = mainPageUpdateCallback;
	uih->pages[MainPageIdx].onLeave = NULL;
	uih->pages[MainPageIdx].onHandleInput = mainPageInputCallback;
	uih->pages[MainPageIdx].data = NULL;

	/* Init Time List Page And Menus */
	TimeListPageData* timeListData = malloc(sizeof(TimeListPageData));	
	timeListData->plan = NULL;
	timeListData->showingItem = NULL;

	uih->pages[TimeListPageIdx].text = "Time List";
	uih->pages[TimeListPageIdx].menu = NULL;
	uih->pages[TimeListPageIdx].actionIcons = "%#$**+-**,. ";
	uih->pages[TimeListPageIdx].onInit = timeListPageOnInitCallback;
	uih->pages[TimeListPageIdx].onUpdate = timeListPageUpdateCallback;
	uih->pages[TimeListPageIdx].onLeave = timeListPageOnLeaveCallback;
	uih->pages[TimeListPageIdx].onHandleInput = timeListPageInputCallback;
	uih->pages[TimeListPageIdx].data = timeListData;

	/* Add Time Plan Page And Menus */
	AddTimePlanPageData* addTimePlanData = malloc(sizeof(AddTimePlanPageData));
	addTimePlanData->editingPlan = NULL;

	uih->pages[AddTimePlanPageIdx].text = "Time Plan";
	uih->pages[AddTimePlanPageIdx].menu = NULL;
	uih->pages[AddTimePlanPageIdx].actionIcons = "%('!";
	uih->pages[AddTimePlanPageIdx].onInit = addTimePlanPageOnInitCallback;
	uih->pages[AddTimePlanPageIdx].onUpdate = addTimePlanPageUpdateCallback;
	uih->pages[AddTimePlanPageIdx].onLeave = NULL;
	uih->pages[AddTimePlanPageIdx].onHandleInput = addTimePlanPageInputCallback;
	uih->pages[AddTimePlanPageIdx].data = addTimePlanData;

	/* Add Timer Item Page And Menus */
	AddTimerItemPageData* addTimerItemData = malloc(sizeof(AddTimerItemPageData));
	addTimerItemData->plan = NULL;
	addTimerItemData->editingItem = NULL;

	uih->pages[AddTimerItemPageIdx].text = "Timer Item";
	uih->pages[AddTimerItemPageIdx].menu = NULL;
	uih->pages[AddTimerItemPageIdx].actionIcons = "%('!";
	uih->pages[AddTimerItemPageIdx].onInit = addTimerItemPageOnInitCallback;
	uih->pages[AddTimerItemPageIdx].onUpdate = addTimerItemPageUpdateCallback;
	uih->pages[AddTimerItemPageIdx].onLeave = NULL;
	uih->pages[AddTimerItemPageIdx].onHandleInput = addTimerItemPageInputCallback;
	uih->pages[AddTimerItemPageIdx].data = addTimerItemData;

	/* Init Settings Page And Menus */
	
	UiMenuPtr settingMenus = (UiMenuPtr)malloc(sizeof(UiMenu) * 2);
	if (!settingMenus)
		return;
	UserInterface_InitMenu(&settingMenus[0], "Time", 					NULL, &settingMenus[1], NULL, &uih->pages[SettingPageIdx], &uih->pages[SetTimePageIdx], NULL, NULL);
	UserInterface_InitMenu(&settingMenus[1], "Sleep Time", 		&settingMenus[0], NULL, NULL, &uih->pages[SettingPageIdx], &uih->pages[SetSleepTimePageIdx], NULL, NULL);
	
	uih->pages[SettingPageIdx].text = "Settings";
	uih->pages[SettingPageIdx].menu = settingMenus;
	uih->pages[SettingPageIdx].actionIcons = NULL;
	uih->pages[SettingPageIdx].onInit = NULL;
	uih->pages[SettingPageIdx].onUpdate = NULL;
	uih->pages[SettingPageIdx].onLeave = NULL;
	uih->pages[SettingPageIdx].onHandleInput = settingsPageInputCallback;
	uih->pages[SettingPageIdx].data = NULL;

	/* Init Set Time Page And Data */
	
	RTC_TimeTypeDef *sTime = malloc(sizeof(RTC_TimeTypeDef));
	if (HAL_RTC_GetTime(&hrtc, sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
		
	RTC_DateTypeDef *sDate = malloc(sizeof(RTC_DateTypeDef));
	if (HAL_RTC_GetDate(&hrtc, sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}

	SetTimePageData* setTimeData = malloc(sizeof(SetTimePageData));	
	setTimeData->sTime = sTime;
	setTimeData->sDate = sDate;
	
	uih->pages[SetTimePageIdx].text = NULL;
	uih->pages[SetTimePageIdx].actionIcons = "%('!";
	uih->pages[SetTimePageIdx].onInit = setTimePageOnInitCallback;
	uih->pages[SetTimePageIdx].onUpdate = setTimePageUpdateCallback;
	uih->pages[SetTimePageIdx].onLeave = NULL;
	uih->pages[SetTimePageIdx].onHandleInput = setTimePageInputCallback;
	uih->pages[SetTimePageIdx].data = setTimeData;

	/* Init Set Sleep Time Page And Data */

	SetSleepTimePageData* setSleepTimeData = malloc(sizeof(SetSleepTimePageData));	
	setSleepTimeData->sleepTime = 0;
	
	uih->pages[SetSleepTimePageIdx].text = NULL;
	uih->pages[SetSleepTimePageIdx].actionIcons = "%('!";
	uih->pages[SetSleepTimePageIdx].onInit = setSleepTimePageOnInitCallback;
	uih->pages[SetSleepTimePageIdx].onUpdate = setSleepTimePageUpdateCallback;
	uih->pages[SetSleepTimePageIdx].onLeave = NULL;
	uih->pages[SetSleepTimePageIdx].onHandleInput = setSleepTimePageInputCallback;
	uih->pages[SetSleepTimePageIdx].data = setSleepTimeData;

	/* Init Message Popup And Data */
	
	MessagePopupData* msgPopupData = malloc(sizeof(MessagePopupData));
	msgPopupData->secondCounter = 0;
	msgPopupData->secondsToShow = 0;
	msgPopupData->fallbackPage = NULL;
	
	uih->pages[MessagePopupIdx].text = NULL;
	uih->pages[MessagePopupIdx].actionIcons = "";
	uih->pages[MessagePopupIdx].onInit = messagePopupOnInitCallback;
	uih->pages[MessagePopupIdx].onUpdate = messagePopupUpdateCallback;
	uih->pages[MessagePopupIdx].onLeave = NULL;
	uih->pages[MessagePopupIdx].onHandleInput = messagePopupInputCallback;
	uih->pages[MessagePopupIdx].data = msgPopupData;


