the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
	data->settingStep = 0;
	if (data->editingPlan == NULL)
	{
		data->plan.day = 0;
		data->plan.mode = Daily;
		
		int i;
		for (i = 0; i < MAX_TIMES_PER_PLAN; i++)
			TimePlan_RemoveItem(&data->plan, i);
	} else {
		data->plan.day = data->editingPlan->day - (data->editingPlan->mode == Monthly? 1: 0);
		data->plan.mode = data->editingPlan->mode;
	}
}

uint8_t addTimePlanPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	ssd1306_Fill(Black);
	ssd1306_SetCursor(5, 5);

	char buff[24] = {0};
	switch(data->settingStep)
	{
		case 0:	//setting plan mode
		{
			snprintf(buff, 24, "Mode: %c", g_timeModes[data->plan.mode]);
			break;
		}
		case 1: //setting day if mode is w/m
		{
			if (data->plan.mode == Weekly)
			{
				snprintf(buff, 24, "Day: %s", g_weekDays[data->plan.day]);
			}
			else if (data->plan.mode == Monthly)
			{
				snprintf(buff, 24, "Day: %d", data->plan.day+1);
			}
			break;
		}
	}
	ssd1306_WriteString(buff, Font_11x18, White);
	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void addTimePlanPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		case Key2:
			if (data->settingStep == 0)
			{
				data->plan.mode = (data->plan.mode + 4 - 1) % 4;
				if (data->plan.mode == 0)
					data->plan.mode = Daily;
			}
			else if (data->settingStep == 1)
			{
				if (data->plan.mode == Weekly)
					data->plan.day = (data->plan.day + 7 - 1) % 7;
				else if (data->plan.mode == Monthly)
					data->plan.day = (data->plan.day + 31 - 1) % 31;
			}
			break;
		case Key3:
			if (data->settingStep == 0)
			{
				data->plan.mode = (data->plan.mode + 1) % 4;
				if (data->plan.mode == 0)
					data->plan.mode = Monthly;
			}
			else if (data->settingStep == 1)
			{
				if (data->plan.mode == Weekly)
					data->plan.day = (data->plan.day + 1) % 7;
				else if (data->plan.mode == Monthly)
					data->plan.day = (data->plan.day + 1) % 31;
			}
			break;
		case Key4:
		{
			if (data->plan.mode != Daily && data->settingStep < 1)
			{
				data->settingStep++;
			}
			else
			{
				if (data->editingPlan == NULL)
				{
					TimePlan* newPlan = Timer_AddPlan(timeList, data->plan.mode);
					if (newPlan == NULL)
					{
						UserInterface_ShowPopup(uih, "No memory!", 3, &((UiHandle*)uih)->pages[TimeListPageIdx]);
						return;
					}
					newPlan->day = data->plan.day + (data->plan.mode == Monthly? 1: 0);
					
					AddTimerItemPageData* addItemData = ((UiHandle*)uih)->pages[AddTimerItemPageIdx].data;
					addItemData->plan = newPlan;
					addItemData->editingItem = NULL;
					UserInterface_ShowPopup(uih, "Created!", 3, &((UiHandle*)uih)->pages[AddTimerItemPageIdx]);
				}
				else
				{
					data->editingPlan->day = data->plan.day + (data->plan.mode == Monthly? 1: 0);
					data->editingPlan->mode = data->plan.mode;
					UserInterface_ShowPopup(uih, "Updated!", 3, &((UiHandle*)uih)->pages[TimeListPageIdx]);
				}
			}
			break;
		}
		default:
			break;
	}
}

void addTimerItemPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	AddTimerItemPageData* data = hnd->currentPage->data;

	data->settingStep = 0;
	if (data->editingItem == NULL)
	{
		data->hours = 0;
		data->minutes = 0;
		data->status = 0;
	}
	else
	{
		data->hours = data->editingItem->hours;
		data->minutes = data->editingItem->minutes;
		data->status = data->editingItem->status;
	}
}

uint8_t addTimerItemPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	AddTimerItemPageData* data = hnd->currentPage->data;

	ssd1306_Fill(Black);
	ssd1306_SetCursor(5, 5);

	char buff[24] = {0};
	switch(data->settingStep)
	{
		case 0:	//setting hour
		{
			snprintf(buff, 24, "[%02d]: %02d", data->hours, data->minutes);
			break;
		}
		case 1:	//setting minute
		{
			snprintf(buff, 24, "%02d :[%02d]", data->hours, data->minutes);
			break;
		}
		case 2: //setting status
		{
			snprintf(buff, 24, "Status: %s", data->status? "On": "Off");
			break;
		}
	}
	ssd1306_WriteString(buff, Font_11x18, White);
	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void addTimerItemPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	AddTimerItemPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		case Key2:
			if (data->settingStep == 0)
			{
				data->hours = (data->hours + 24 - 1) % 24;
			}
			else if (data->settingStep == 1)
			{
				data->minutes = (data->minutes + 60 - 1) % 60;
			}
			else if (data->settingStep == 2)
			{
				data->status = (data->status + 2 - 1) % 2;
			}
			break;
		case Key3:
			if (data->settingStep == 0)
			{
				data->hours = (data->hours + 1) % 24;
			}
			else if (data->settingStep == 1)
			{
				data->minutes = (data->minutes + 1) % 60;
			}
			else if (data->settingStep == 2)
			{
				data->status = (data->status + 1) % 2;
			}
			break;
		case Key4:
		{
			if (data->settingStep < 2)
			{
				data->settingStep++;
			}
			else
			{
				if (data->editingItem == NULL)
				{
					TimerItem* item = TimePlan_AddItem(data->plan);
					if (item == NULL)
					{
						UserInterface_ShowPopup(uih, "No memory!", 3, &((UiHandle*)uih)->pages[TimeListPageIdx]);
						return;
					}
					
					item->status = data->status;
					item->hours = data->hours;
					item->minutes = data->minutes;
					
					data->editingItem = NULL;
					UserInterface_ShowPopup(uih, "Created!", 3, &((UiHandle*)uih)->pages[AddTimerItemPageIdx]);
				}
				else
				{
					data->editingItem->status = data->status;
					data->editingItem->hours = data->hours;
					data->editingItem->minutes = data->minutes;
					UserInterface_ShowPopup(uih, "Updated!", 3, &((UiHandle*)uih)->pages[TimeListPageIdx]);
				}
			}
			break;
		}
		default:
			break;
	}
}

